Revit 2024 API
ScheduleSheetInstance Class
 An element that represents a particular placement of a schedule on a sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class ScheduleSheetInstance : Element
Visual Basic
Public Class ScheduleSheetInstance _
	Inherits Element
Visual C++
public ref class ScheduleSheetInstance : public Element
Remarks
 Use ScheduleSheetInstance.OwnerViewId to find the sheet on which a schedule is placed.
 When a schedule is set to filter by sheet and placed on a sheet, it will create a new schedule with elements visible in the Viewport(s) on that sheet. The instance created belongs to the newly created schedule.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ScheduleSheetInstance
See Also
ScheduleSheetInstance Members
Autodesk.Revit.DB Namespace